[
  {
    "title": "First post",
    "published_date": "April 27th, 2023",
    "content": "The punisher, alongside [One Shot](https://github.com/Leeous/one_shot), are my main projects as of right now.\n\nI've attempted FPS rigs before, but I'll be honest, I was never able to get down the various intricacies of creating viewmodels for Source 1. For this rig, I have a simpler gun, better tools, and way better hands to work with.\n\nThis gun, if you're unfamiliar, is from Resident Evil 4 (2023). I plan on porting more guns/props from RE4, and making content for gamemode devs to use in their projects.\n\nAs for my gamemode, One Shot, it is mostly a test project for me to try out the S&Box workflow. So far, S&Box has been really fun to work with. I can only imagine what people will create. I have no doubt that S&Box can easily hit the top 10 if they play their cards right. Developers are already showing off their talent even while the API is changing almost daily.\n\nI'm excited for the future. :)\n\n![Render 2](resource/imgs/blog/post1/render2.png)\n![Render 1](resource/imgs/blog/post1/render1.png)\n\nYou can find all of my S&box uploads [here](https://asset.party/leeous)."
  },
  {
    "title": "Reprioritization",
    "published_date": "October 6th, 2023",
    "content": "So I was planning to work on projects related to S&Box, however, I think I need to go back to basics and ensure I'm ready for the full release.\n\nI don't mind learning on the fly at all — in fact, it's how I learn most things — but I feel like it would be a big benefit to me understanding the language better.\n\nI consider myself a web developer over any other title that could apply to me, but I'd like to expand that title.\n\nAs of today, I'm going to be focusing on certifications and expanding my knowledge. I'll still be working on smaller projects, so One Shot and the punisher are projects for later, when I have more focus, knowledge, and time."
  },
  {
    "title": "New Year",
    "published_date": "December 25th, 2024",
    "content": "2024 was an interesting and busy year in my personal life. Unfortunately, that means I've not been working on much of anything outside of my current job.\n\nPart of this was getting used to working from home, and learning the many workflows that come with my current role. Since I've mostly gotten used to my current work-life balance, I should be able to prioritize working on more portfolio-type projects.\n\nAfter the new year, I'm hoping to have a couple of projects spun up, and to also complete the [BCBS Prefix Explorer](https://github.com/Leeous/bcbs-prefix-explorer).\n\nI seem to be the most motivated around the start of a new year, and hopefully can reflect that here."
  }, 
  {
    "title": "BCBS Explorer & next project",
    "published_date": "December 25th, 2024",
    "content": "[BCBS Explorer](https://github.com/Leeous/bcbs-explorer) is finished! With the latest update, I think I'll be moving on from this project. You can now override carrier data, create custom carriers for prefixes that are reactivated, and more.\n\nAdmittedly, BCBS Explorer was more of an excuse to dive into the React workflow and structure. Needless to say, I'm a pretty big fan. No doubt it isn't perfect, but since it's a first attempt, I'm okay with it's current state.\n\n Moving on, I'm trying my hand at Qt. I've been using Linux for a little over a year now, and as a KDE user, I've always wanted to understand more about how KDE widgets work. This'll be a simple widget that embeds a window that allows you to query ChatGPT, likely in the taskbar. You can track progress here: [plasma-chatgpt](https://github.com/Leeous/plasma-chatgpt)."
  }
]
